{
  "collection_name": "school_bus_tracking",
  "collection_description": "Information about real-time school bus tracking systems implemented by school districts, focusing on the Stopfinder app used in Waukegan Community Unit School District 60.",
  "title": "Waukegan Schools Launch Real-Time Bus Tracking App for Parents",
  "summary": "Waukegan Community Unit School District 60 (Illinois) has implemented Stopfinder, a real-time school bus tracking app that allows parents to monitor their children's bus location and estimated arrival times. The app, launched on September 22, 2025, replaces a previous non-real-time system and serves 450 bus routes across 23 schools, with over 745 families already using it.",
  "main_topics": [
    "school transportation",
    "real-time bus tracking",
    "parental safety tools",
    "Stopfinder app",
    "Waukegan School District"
  ],
  "key_points": [
    "Stopfinder is a real-time bus tracking app launched by Waukegan Community District 60 on September 22, 2025.",
    "The app allows parents to view live bus locations, receive arrival time estimates, and set alerts for when the bus is 5 or 10 minutes away.",
    "It supports monitoring multiple children across different schools (e.g., elementary and middle school).",
    "As of October 2025, 745 families were using the app across the district’s 450 bus routes serving 15 elementary, 5 middle, and 3 high school campuses.",
    "District officials emphasize the app’s role in reducing wait times, improving safety awareness, and providing peace of mind—particularly amid broader community concerns about student safety at bus stops.",
    "Parents must request access via email through the district website to receive a registration link."
  ],
  "detailed_content": "Waukegan Community Unit School District 60 (IL) has introduced Stopfinder, a real-time school bus tracking application for parents. Launched on September 22, 2025, the app replaces a previous system that did not offer live tracking. Through Stopfinder, parents can monitor their child’s bus in real time—viewing its movement on a map, receiving precise arrival estimates at designated stops or schools, and setting notifications for when the bus is 5 or 10 minutes away. The system covers all 450 of the district’s bus routes, which serve 15 elementary schools, five middle schools, and three high school campuses. As of early October 2025, 745 families had enrolled in the service. District leaders, including Transportation Manager Alicia Williams and Superintendent Theresa Plascencia, highlight the app’s benefits: reducing unnecessary waiting at bus stops, enhancing awareness of student whereabouts, and offering greater peace of mind—especially in light of community safety concerns. Although implementation was planned before U.S. Department of Homeland Security’s Operation Midway Blitz (launched September 5, 2025), officials note the app may provide added reassurance to vulnerable families. To access Stopfinder, parents must follow instructions on the district’s website and submit an email request to receive a personalized registration link.",
  "entities": {
    "people": [
      "Alicia Williams",
      "Steve Sadin",
      "Theresa Plascencia",
      "Nick Alatzakis",
      "Robb Snyder"
    ],
    "organizations": [
      "Waukegan Community Unit School District 60",
      "Transfinder",
      "Chicago Tribune",
      "U.S. Department of Homeland Security"
    ],
    "locations": [
      "Waukegan, Illinois"
    ],
    "dates": [
      "2025-09-05",
      "2025-09-22",
      "2025-10-13"
    ]
  },
  "metadata": {
    "source_url": "https://www.transfinder.com/news_events/Waukegan-schools-app-tracks-students-buses_2393-blog.htm",
    "extracted_at": "2025-12-19T18:51:38.613542",
    "content_type": "news"
  }
}